p 'Have a nice day'.class # додати в файл виведення базавох рубішних літералів
p 99.class# додати в файл виведення базавох рубішних літералів
p 99.9.class# додати в файл виведення базавох рубішних літералів
p false.class# додати в файл виведення базавох рубішних літералів
p true.class# додати в файл виведення базавох рубішних літералів

=begin
Оголосити вираз типу total = a + b з перенесенням другого
операнда на новий рядок, та переконатися в тому, що Ruby продовжує
побудову виразу,якщо в кінці рядка знаходить будь-який оператор
=end

p my_name = "Alex" #оголошення змінної
p my_age = 35#оголошення змінної
p max_speed_of_a_car = "240 km/h".to_i#оголошення змінної
p person_has_a_car = true#оголошення змінної
#p 7/0 ZeroDivisionError - закоментований рядок
#My-Name = "Alex" -не правиильна назва змінної
#1name = "Alex" - не правиильна назва змінної
x = 3
y = 2
summa = x +
y#Оголосити вираз типу total = a + b з перенесенням другого операнда на новий рядок
p summa
total = x
+ y#Оголосити вираз типу total = a + b з перенесенням другого операнда із оператором
p total
summa_2 = x \
+ y#total = a + b перенести + b на новий рядок за допомогою спеціального оператора '\'
p summa_2
p 7/3
p 99%22#остача від ділення
#p 5/0 - хибна відповідь, на 0 ділити не можна!!!
p 3/0.0 #Infinity
p 0.3/0 #Infinity - ділення дробу на 0

z = 5#оголошення змінної
p z**3 #піднесення до степеня

p 'BMW IS THE BEST CAR IN THE WORLD' #рядковий літерал одинарні лапки
p 'it\'s not your fault '#екранування

name_age = "Alex, I am 35 years old."
p "Hello! My name is #{name_age}"#інтерполяція

puts "Багато-багато\nтексту\nв\nрядку" #перенесенням за допомогою "\"
word = 'Hello'
word_1 = '!!!'
p word + word_1#додавання рядків
p %- Оголошення рядкового літералу-#оголошення рядка за допомогою %
p %q(Some text)#оголошення рядка за допомогою %q
text ="give me more"
p %Q{some text, some text #{text}} #оголошення за допомогою %Q + інтерполяція
p "I want one " << "milione dollars!!!"# додавання тексту за допомого оператора "<<"
my_text = "I love Ruby"
p my_text[0]+my_text[-4]
p my_text["I"]+["R"]
p my_text[/I/]+[/R/]
p 'Ruby'[-7]#отримання значення nil
text_2 = 'Hello Ruby'
p text_2[/Ruby/]
p text_2["Ruby"]#отримання підрядка 'Ruby'
p (text_3 = 'Ruby is awesome'.split - ['is']).join ' '#видалення 'is' з рядка
p text_3 = 'RUBY'.downcase#переведення в нижній регістр
p 'Ruby courses'.length#кількість символів, ще може бути 'size'
p 'Ruby'.reverse#вивести 'ybuR'
